# Нужно написать программу, валидирующую ввод пользователя. 
# Сначала нужно спросить имя пользователя,
#  и если он ввел некорректные данные - выводить ошибку и повторять запрос,
#  пока пользователь не введет правильные данные
# Имя считаеться правильным только если оно состоит из алфавитных символов, 
#  символа минус(дефис), пробела и апострофа ('), регистр не имеет значения
#
# Например: 
#   Андрей - правильное имя, 
#   Ху'ун Хур-ту, тоже правильное,
#   Mr. Bean - уже не правильное (в нем есть недопустимый символ - точка)

